ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151dxx_ca7.h
#define ADC_CCR_DAMDF_Pos                 (14U)
#define ADC_CCR_DAMDF_Msk                 (0x3U << ADC_CCR_DAMDF_Pos)          /*!< 0x0000C000 */
#define ADC_CCR_DAMDF                     ADC_CCR_DAMDF_Msk                    /*!< Dual ADC mode Data format */
#define ADC_CCR_DAMDF_0                   (0x1U << ADC_CCR_DAMDF_Pos)          /*!< 0x00004000 */
#define ADC_CCR_DAMDF_1                   (0x2U << ADC_CCR_DAMDF_Pos)          /*!< 0x00008000 */

#define ADC_CCR_CKMODE_Pos                (16U)
#define ADC_CCR_CKMODE_Msk                (0x3U << ADC_CCR_CKMODE_Pos)         /*!< 0x00030000 */
#define ADC_CCR_CKMODE                    ADC_CCR_CKMODE_Msk                   /*!< ADC clock mode */
#define ADC_CCR_CKMODE_0                  (0x1U << ADC_CCR_CKMODE_Pos)         /*!< 0x00010000 */
#define ADC_CCR_CKMODE_1                  (0x2U << ADC_CCR_CKMODE_Pos)         /*!< 0x00020000 */

#define ADC_CCR_PRESC_Pos                 (18U)
#define ADC_CCR_PRESC_Msk                 (0xFU << ADC_CCR_PRESC_Pos)          /*!< 0x003C0000 */
#define ADC_CCR_PRESC                     ADC_CCR_PRESC_Msk                    /*!< ADC prescaler */
#define ADC_CCR_PRESC_0                   (0x1U << ADC_CCR_PRESC_Pos)          /*!< 0x00040000 */
#define ADC_CCR_PRESC_1                   (0x2U << ADC_CCR_PRESC_Pos)          /*!< 0x00080000 */
#define ADC_CCR_PRESC_2                   (0x4U << ADC_CCR_PRESC_Pos)          /*!< 0x00100000 */
#define ADC_CCR_PRESC_3                   (0x8U << ADC_CCR_PRESC_Pos)          /*!< 0x00200000 */

#define ADC_CCR_VREFEN_Pos                (22U)
#define ADC_CCR_VREFEN_Msk                (0x1U << ADC_CCR_VREFEN_Pos)         /*!< 0x00400000 */
#define ADC_CCR_VREFEN                    ADC_CCR_VREFEN_Msk                   /*!< VREFINT enable */
#define ADC_CCR_VSENSEEN_Pos              (23U)
#define ADC_CCR_VSENSEEN_Msk              (0x1U << ADC_CCR_VSENSEEN_Pos)      /*!< 0x00800000 */
#define ADC_CCR_VSENSEEN                  ADC_CCR_VSENSEEN_Msk                /*!< Temperature sensor enable */
#define ADC_CCR_VBATEN_Pos                (24U)
#define ADC_CCR_VBATEN_Msk                (0x1U << ADC_CCR_VBATEN_Pos)         /*!< 0x01000000 */
#define ADC_CCR_VBATEN                    ADC_CCR_VBATEN_Msk                   /*!< VBAT enable */

/********************  Bit definition for ADC_CDR register  ********************/
#define ADC_CDR_RDATA_MST_Pos          (0U)
#define ADC_CDR_RDATA_MST_Msk          (0xFFFFU << ADC_CDR_RDATA_MST_Pos) /*!< 0x0000FFFF */
#define ADC_CDR_RDATA_MST              ADC_CDR_RDATA_MST_Msk             /*!< Regular Data of the master ADC */
#define ADC_CDR_RDATA_MST_0            (0x0001U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000001 */
#define ADC_CDR_RDATA_MST_1            (0x0002U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000002 */
#define ADC_CDR_RDATA_MST_2            (0x0004U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000004 */
#define ADC_CDR_RDATA_MST_3            (0x0008U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000008 */
#define ADC_CDR_RDATA_MST_4            (0x0010U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000010 */
#define ADC_CDR_RDATA_MST_5            (0x0020U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000020 */
#define ADC_CDR_RDATA_MST_6            (0x0040U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000040 */
#define ADC_CDR_RDATA_MST_7            (0x0080U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000080 */
#define ADC_CDR_RDATA_MST_8            (0x0100U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000100 */
#define ADC_CDR_RDATA_MST_9            (0x0200U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000200 */
#define ADC_CDR_RDATA_MST_10           (0x0400U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000400 */
#define ADC_CDR_RDATA_MST_11           (0x0800U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00000800 */
#define ADC_CDR_RDATA_MST_12           (0x1000U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00001000 */
#define ADC_CDR_RDATA_MST_13           (0x2000U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00002000 */
#define ADC_CDR_RDATA_MST_14           (0x4000U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00004000 */
#define ADC_CDR_RDATA_MST_15           (0x8000U << ADC_CDR_RDATA_MST_Pos) /*!< 0x00008000 */

#define ADC_CDR_RDATA_SLV_Pos          (16U)
#define ADC_CDR_RDATA_SLV_Msk          (0xFFFFU << ADC_CDR_RDATA_SLV_Pos) /*!< 0xFFFF0000 */
#define ADC_CDR_RDATA_SLV              ADC_CDR_RDATA_SLV_Msk             /*!< Regular Data of the master ADC */
#define ADC_CDR_RDATA_SLV_0            (0x0001U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00010000 */
#define ADC_CDR_RDATA_SLV_1            (0x0002U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00020000 */
#define ADC_CDR_RDATA_SLV_2            (0x0004U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00040000 */
#define ADC_CDR_RDATA_SLV_3            (0x0008U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00080000 */
#define ADC_CDR_RDATA_SLV_4            (0x0010U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00100000 */
#define ADC_CDR_RDATA_SLV_5            (0x0020U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00200000 */
#define ADC_CDR_RDATA_SLV_6            (0x0040U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00400000 */
#define ADC_CDR_RDATA_SLV_7            (0x0080U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x00800000 */
#define ADC_CDR_RDATA_SLV_8            (0x0100U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x01000000 */
#define ADC_CDR_RDATA_SLV_9            (0x0200U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x02000000 */
#define ADC_CDR_RDATA_SLV_10           (0x0400U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x04000000 */
#define ADC_CDR_RDATA_SLV_11           (0x0800U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x08000000 */
#define ADC_CDR_RDATA_SLV_12           (0x1000U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x10000000 */
#define ADC_CDR_RDATA_SLV_13           (0x2000U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x20000000 */
#define ADC_CDR_RDATA_SLV_14           (0x4000U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x40000000 */
#define ADC_CDR_RDATA_SLV_15           (0x8000U << ADC_CDR_RDATA_SLV_Pos) /*!< 0x80000000 */

/********************  Bit definition for ADC_CDR2 register  ********************/
#define ADC_CDR2_RDATA_ALT_Pos         (0U)
#define ADC_CDR2_RDATA_ALT_Msk         (0xFFFFFFFFU << ADC_CDR2_RDATA_ALT_Pos) /*!< 0xFFFFFFFF */
#define ADC_CDR2_RDATA_ALT             ADC_CDR2_RDATA_ALT_Msk            /*!< Regular Data for dual Mode */
#define ADC_CDR2_RDATA_ALT_0           (0x00000001U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000001 */
#define ADC_CDR2_RDATA_ALT_1           (0x00000002U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000002 */
#define ADC_CDR2_RDATA_ALT_2           (0x00000004U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000004 */
#define ADC_CDR2_RDATA_ALT_3           (0x00000008U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000008 */
#define ADC_CDR2_RDATA_ALT_4           (0x00000010U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000010 */
#define ADC_CDR2_RDATA_ALT_5           (0x00000020U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000020 */
#define ADC_CDR2_RDATA_ALT_6           (0x00000040U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000040 */
#define ADC_CDR2_RDATA_ALT_7           (0x00000080U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000080 */
#define ADC_CDR2_RDATA_ALT_8           (0x00000100U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000100 */
#define ADC_CDR2_RDATA_ALT_9           (0x00000200U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000200 */
#define ADC_CDR2_RDATA_ALT_10          (0x00000400U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000400 */
#define ADC_CDR2_RDATA_ALT_11          (0x00000800U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00000800 */
#define ADC_CDR2_RDATA_ALT_12          (0x00001000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00001000 */
#define ADC_CDR2_RDATA_ALT_13          (0x00002000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00002000 */
#define ADC_CDR2_RDATA_ALT_14          (0x00004000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00004000 */
#define ADC_CDR2_RDATA_ALT_15          (0x00008000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00008000 */
#define ADC_CDR2_RDATA_ALT_16          (0x00010000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00010000 */
#define ADC_CDR2_RDATA_ALT_17          (0x00020000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00020000 */
#define ADC_CDR2_RDATA_ALT_18          (0x00040000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00040000 */
#define ADC_CDR2_RDATA_ALT_19          (0x00080000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00080000 */
#define ADC_CDR2_RDATA_ALT_20          (0x00100000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00100000 */
#define ADC_CDR2_RDATA_ALT_21          (0x00200000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00200000 */
#define ADC_CDR2_RDATA_ALT_22          (0x00400000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00400000 */
#define ADC_CDR2_RDATA_ALT_23          (0x00800000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x00800000 */
#define ADC_CDR2_RDATA_ALT_24          (0x01000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x01000000 */
#define ADC_CDR2_RDATA_ALT_25          (0x02000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x02000000 */
#define ADC_CDR2_RDATA_ALT_26          (0x04000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x04000000 */
#define ADC_CDR2_RDATA_ALT_27          (0x08000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x08000000 */
#define ADC_CDR2_RDATA_ALT_28          (0x10000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x10000000 */
#define ADC_CDR2_RDATA_ALT_29          (0x20000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x20000000 */
#define ADC_CDR2_RDATA_ALT_30          (0x40000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x40000000 */
#define ADC_CDR2_RDATA_ALT_31          (0x80000000U << ADC_CDR2_RDATA_ALT_Pos) /*!< 0x80000000 */


/*****************  Bit definition for ADC_VERR register  ******************/
#define ADC_VERR_MINREV_Pos               (0U)
#define ADC_VERR_MINREV_Msk               (0xFU << ADC_VERR_MINREV_Pos)        /*!< 0x0000000F */
#define ADC_VERR_MINREV                   ADC_VERR_MINREV_Msk                  /*!< Minor revision */
#define ADC_VERR_MINREV_0                 (0x1U << ADC_VERR_MINREV_Pos)        /*!< 0x00000001 */
#define ADC_VERR_MINREV_1                 (0x2U << ADC_VERR_MINREV_Pos)        /*!< 0x00000002 */
#define ADC_VERR_MINREV_2                 (0x4U << ADC_VERR_MINREV_Pos)        /*!< 0x00000004 */
#define ADC_VERR_MINREV_3                 (0x8U << ADC_VERR_MINREV_Pos)        /*!< 0x00000008 */
#define ADC_VERR_MAJREV_Pos               (4U)
#define ADC_VERR_MAJREV_Msk               (0xFU << ADC_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define ADC_VERR_MAJREV                   ADC_VERR_MAJREV_Msk                  /*!< Major revision */
#define ADC_VERR_MAJREV_0                 (0x1U << ADC_VERR_MAJREV_Pos)        /*!< 0x00000010 */
#define ADC_VERR_MAJREV_1                 (0x2U << ADC_VERR_MAJREV_Pos)        /*!< 0x00000020 */
#define ADC_VERR_MAJREV_2                 (0x4U << ADC_VERR_MAJREV_Pos)        /*!< 0x00000040 */
#define ADC_VERR_MAJREV_3                 (0x8U << ADC_VERR_MAJREV_Pos)        /*!< 0x00000080 */

/*****************  Bit definition for ADC_IPDR register  ******************/
#define ADC_IPDR_ID_Pos                   (0U)
#define ADC_IPDR_ID_Msk                   (0xFFFFFFFFU << ADC_IPDR_ID_Pos)     /*!< 0xFFFFFFFF */
#define ADC_IPDR_ID                       ADC_IPDR_ID_Msk                      /*!< Peripheral identifier */
#define ADC_IPDR_ID_0                     (0x1U << ADC_IPDR_ID_Pos)            /*!< 0x00000001 */
#define ADC_IPDR_ID_1                     (0x2U << ADC_IPDR_ID_Pos)            /*!< 0x00000002 */
#define ADC_IPDR_ID_2                     (0x4U << ADC_IPDR_ID_Pos)            /*!< 0x00000004 */
#define ADC_IPDR_ID_3                     (0x8U << ADC_IPDR_ID_Pos)            /*!< 0x00000008 */
#define ADC_IPDR_ID_4                     (0x10U << ADC_IPDR_ID_Pos)           /*!< 0x00000010 */
#define ADC_IPDR_ID_5                     (0x20U << ADC_IPDR_ID_Pos)           /*!< 0x00000020 */
#define ADC_IPDR_ID_6                     (0x40U << ADC_IPDR_ID_Pos)           /*!< 0x00000040 */
#define ADC_IPDR_ID_7                     (0x80U << ADC_IPDR_ID_Pos)           /*!< 0x00000080 */
#define ADC_IPDR_ID_8                     (0x100U << ADC_IPDR_ID_Pos)          /*!< 0x00000100 */
#define ADC_IPDR_ID_9                     (0x200U << ADC_IPDR_ID_Pos)          /*!< 0x00000200 */
#define ADC_IPDR_ID_10                    (0x400U << ADC_IPDR_ID_Pos)          /*!< 0x00000400 */
#define ADC_IPDR_ID_11                    (0x800U << ADC_IPDR_ID_Pos)          /*!< 0x00000800 */
#define ADC_IPDR_ID_12                    (0x1000U << ADC_IPDR_ID_Pos)         /*!< 0x00001000 */
#define ADC_IPDR_ID_13                    (0x2000U << ADC_IPDR_ID_Pos)         /*!< 0x00002000 */
#define ADC_IPDR_ID_14                    (0x4000U << ADC_IPDR_ID_Pos)         /*!< 0x00004000 */
#define ADC_IPDR_ID_15                    (0x8000U << ADC_IPDR_ID_Pos)         /*!< 0x00008000 */
#define ADC_IPDR_ID_16                    (0x10000U << ADC_IPDR_ID_Pos)        /*!< 0x00010000 */
#define ADC_IPDR_ID_17                    (0x20000U << ADC_IPDR_ID_Pos)        /*!< 0x00020000 */
#define ADC_IPDR_ID_18                    (0x40000U << ADC_IPDR_ID_Pos)        /*!< 0x00040000 */
#define ADC_IPDR_ID_19                    (0x80000U << ADC_IPDR_ID_Pos)        /*!< 0x00080000 */
#define ADC_IPDR_ID_20                    (0x100000U << ADC_IPDR_ID_Pos)       /*!< 0x00100000 */
#define ADC_IPDR_ID_21                    (0x200000U << ADC_IPDR_ID_Pos)       /*!< 0x00200000 */
#define ADC_IPDR_ID_22                    (0x400000U << ADC_IPDR_ID_Pos)       /*!< 0x00400000 */
#define ADC_IPDR_ID_23                    (0x800000U << ADC_IPDR_ID_Pos)       /*!< 0x00800000 */
#define ADC_IPDR_ID_24                    (0x1000000U << ADC_IPDR_ID_Pos)      /*!< 0x01000000 */
#define ADC_IPDR_ID_25                    (0x2000000U << ADC_IPDR_ID_Pos)      /*!< 0x02000000 */
#define ADC_IPDR_ID_26                    (0x4000000U << ADC_IPDR_ID_Pos)      /*!< 0x04000000 */
#define ADC_IPDR_ID_27                    (0x8000000U << ADC_IPDR_ID_Pos)      /*!< 0x08000000 */
#define ADC_IPDR_ID_28                    (0x10000000U << ADC_IPDR_ID_Pos)     /*!< 0x10000000 */
#define ADC_IPDR_ID_29                    (0x20000000U << ADC_IPDR_ID_Pos)     /*!< 0x20000000 */
#define ADC_IPDR_ID_30                    (0x40000000U << ADC_IPDR_ID_Pos)     /*!< 0x40000000 */
#define ADC_IPDR_ID_31                    (0x80000000U << ADC_IPDR_ID_Pos)     /*!< 0x80000000 */

